

#Область ПрограммныйИнтерфейс

// Параметры JSON.
// 
// Возвращаемое значение:
//  ПараметрыЗаписиJSON - Параметры JSON
Функция ПараметрыJSON() Экспорт
	Возврат Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, Символы.ПС);
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция НоваяЗаписьJSON(ЗаписываемыеДанные) Экспорт
	Запись = Новый ЗаписьJSON();
	Запись.УстановитьСтроку(ПараметрыJSON());
	ЗаписатьJSON(Запись, ЗаписываемыеДанные);
	Возврат Запись;	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОчиститьСтрокуРегулярка(Текст)

	// Шаблон [^0-9] ищет все символы, кроме цифр
	Шаблон ="[^0-9]";		
	// Заменяем все найденные совпадения на пустую строку
	ОчищенныйТекст = СтрЗаменить(Текст, Шаблон, "");
	//Еще что-то дописываю	
	Возврат ОчищенныйТекст;

КонецФункции

#КонецОбласти
