

#Область ПрограммныйИнтерфейс

// Параметры JSON.
// 
// Возвращаемое значение:
//  ПараметрыЗаписиJSON - Параметры JSON
Функция ПараметрыJSON() Экспорт
	Возврат Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, Символы.ПС);
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция НоваяЗаписьJSON(ЗаписываемыеДанные) Экспорт
	Запись = Новый ЗаписьJSON();
	Запись.УстановитьСтроку(ПараметрыJSON());
	ЗаписатьJSON(Запись, ЗаписываемыеДанные);
	Возврат Запись;	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
